# ตัวดำเนินการเปรียบเทียบ

# นำข้อมูลอย่างน้อย 3 คำมาเปรียบเทียบกัน
# ชนิดข้อมูลเหมือนกัน
# คำตอบ 2 คำตอบ => จริง/เท็จ

x=10   
y=5    #รูปแบบแรก
z=9     

x,y,z= 10,5,9 #รูปแบบที่ 2

#หรือ
print("ค่า x มากกว่า y หรือไม่ ? : ", x>y)
print("ค่า x น้อยกว่า y หรือไม่ ? : ", x<y)
print("ค่า x เท่ากับ y หรือไม่ ? : ", x==y)
print("ค่า x ไม่เท่ากับ y หรือไม่ ?", x!=y)

print("ค่า x มากกว่า หรือ เท่ากับ ค่า y หรือไม่ ?",x>=y)
print("ค่า x น้อยกว่า หรือ เท่ากับ ค่า y หรือไม่ ?",x<=y)

#และ
print("ค่า x มากกว่า y และ y มากกว่า z หรือไม่ ? : ",x>y>z)
print("ค่า x น้อยกว่า y และ น้อยดว่า z หรือมไม่",x<y<z)